import 'dart:io';

//TODO: 단위 환산기 만들기
//섭씨 <-> 화씨 변환기
//킬로그램 <-> 파운드 <-> 온스 변환기
//미터 <-> 피트 <-> 야드 <-> 인치 <-> 마일 변환기

Future<void> main(List<String> arguments) async {
  /**
   * [단위 변환기]
   * 1. 섭씨 <-> 화씨
   * 2. 킬로그램 <-> 파운드 <-> 온스
   * 3. 미터 <-> 피트 <-> 야드 <-> 인치 <-> 마일
   * 변환하려는 항목을 선택하세요: 1
   * 
   * 섭씨(C) 또는 화씨(F) 중 입력값의 단위를 선택하세요 (C/F): C
   * 변환하려는 값을 입력하세요: 25
   * 결과: 25°C -> 77°F
   * 
   * [단위 변환기]
   * 변환하려는 항목을 선택하세요: 1
   * 
   * 섭씨(C) 또는 화씨(F) 중 입력값의 단위를 선택하세요 (C/F): F
   * 변환하려는 값을 입력하세요: 100
   * 결과: 100°F -> 37.78°C
   * 
   */
}
